app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "asdfasdf\r\n"], ["user_id", 2], ["post_id", 2], ["created_at", "2017-03-19 20:36:07.391013"], ["updated_at", "2017-03-19 20:36:07.391013"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  ORDER BY created_at  [["post_id", 8]]
---
  def create
    @comment = @post.comments.new( comment_params.merge( user_id: current_user.id ) )
    respond_to do |format|
      if @comment.save
        format.html { redirect_to "#{ post_path(@post) }##{@comment.id}" }
      else
        flash['error'] = @comment.errors.messages.map{ |k, v| "#{ @comment.class.name } #{ k } #{ v[0] }"  }.join(", ")

UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "cool, what"], ["updated_at", "2017-03-19 20:41:33.883563"], ["id", 4]]
---
  def update
    if @comment.update( comment_params )

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
---
    def find_post
      @post = Post.find( params[:post_id] )

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["post_id", 2], ["id", 4]]
---
    def find_comment
      @comment = @post.comments.find( params[:id] )