app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY created_at desc LIMIT 9 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.newest_first.page( params[:page] ).per( params.fetch(:per, 9) )

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1  ORDER BY created_at desc LIMIT 10 OFFSET 0  [["post_id", 33]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 33]]
---
  def show
    @comments = @post.comments.page( params[:page] ).per( params.fetch(:per, 10) )

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["body", "cool"], ["user_id", 1], ["created_at", "2017-03-19 20:14:12.359064"], ["updated_at", "2017-03-19 20:14:12.359064"]]
---
  def create

    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save